<!-- ************************************************* -->
<!-- ****************** Задание 1,2,3 **************** -->
<!-- ************************************************* -->

<table border="1" cellspacing="0">

    <?php
    for ($rows = 1; $rows <= 5; $rows++) :?>
        <tr>

            <?php
            for ($cols = 1; $cols <= 9; $cols++) :?>

                <?php $intro = $rows * $cols;
                if($rows == 1 || $cols == 1) {
                    echo "<td class='intro'>";
                }
                else {
                    echo "<td>";
                }
                ?>

                <?= $intro ?> </td>

            <?php endfor; ?>

        </tr>

    <?php endfor; ?>

</table>

<style>
    .intro {
        font-weight: 600;
        background-color: #d5d5d5;
    }
</style>

<!-- ************************************************* -->
<!-- ****************** Задание 4.1 ****************** -->
<!-- ************************************************* -->

<hr />

<?php

for ($i = 0; $i <= 50; $i++) {
    if($i % 2 !== 0) {
        echo $i, "<br />";
    }
}

?>

<!-- ************************************************* -->
<!-- ***************** Картинка 1.1 ****************** -->
<!-- ************************************************* -->

<hr />

<table border="1" cellspacing="0">

    <?php
    for ($row = 1; $row <= 10; $row++) :?>
        <tr>

            <?php for ($cell = 1; $cell <= 10; $cell++) :?>

                <td> <?= $row*$cell ?> </td>

            <?php endfor; ?>

        </tr>

    <?php endfor; ?>

</table>

<hr />

<!-- ************************************************* -->
<!-- ***************** Картинка 1.2 ****************** -->
<!-- ************************************************* -->


<table border="1" cellspacing="0">

    <?php
    for ($row = 1; $row <= 10; $row++) :?>
        <tr>

            <?php for ($cell = 1; $cell <= 10; $cell++) :?>

                <td> <?php

                    // ************* главная диагональ *************
                    if ($row == $cell) {
                        echo "<b>1</b>";
                    }
                    //************* побочная диагональ *************
                    elseif($row == (11 - $cell)) {
                        echo "<b>2</b>";
                    }
                    // ************* черная магия для нижнего сектора *************
                    elseif($cell > 10-$row && ($row == ($cell + 1)||$row > ($cell + 1))) {
                        echo "5";
                    }
                    // ************* черная магия для левого сектора *************
                    elseif($cell <= 10-$row && ($row == ($cell + 1)||$row > ($cell + 1))) {
                        echo "6";
                    }
                    // ************* верхний сектор *************
                    elseif($cell <= 10-$row && ($row <= ($cell - 1))) {
                        echo "3";
                    }
                    else {
                        echo "4";
                    }
                    ?> </td>
            <?php endfor; ?>
        </tr>
    <?php endfor; ?>
</table>

<br /><br />

<!-- ************************************************* -->
<!-- ***************** Картинка 1.3 ****************** -->
<!-- ************************************************* -->

<?php
// Скопировано с инета
   $first = array(1);
   $second = array();
    for ($i = 1; $i <= 10; $i++) {
        // the first element in each row is 1
        $second[0] = 1;

        for ($j = 1; $j < $i; $j++) {
            $second[$j] = $first[$j] + $first[$j-1];
        }

        echo implode(' ',$second).'<br />';

        $first = $second;

        $second = array();

        $first[] = 0;

    }

    ?>

<br /><br />

<!-- ************************************************* -->
<!-- ***************** Картинка 1.3 ****************** -->
<!-- ************************************************* -->


<table>

    <?php
    for ($row = 1; $row <= 10; $row++) :?>
        <tr>

            <?php for ($cell = 1; $cell <= 10; $cell++) :?>

                <td> <?php

                    $ololo = pow($cell-$row,$row);

    // ************* первая, вторая *************
                    if ($row == $cell || $cell == 1) {
                        echo "<b>1</b>";
                    }
    // ************* третяя *************
                    elseif($row == 3 && $cell < $row) {
                        echo "<b>2</b>";
                    }
    // ************ пустые **************
                    elseif($cell > $row) {
                        echo " ";
                    }
// второй столбец и вторая диагональ
                    elseif($cell == $row-1) {
                        echo "$cell";
                    }
                    elseif($cell == 2) {
                        echo $row-1;
                    }
//**********************************
                    elseif($cell == 3 && $row == 5) {
                        echo 6;
                    }
//**********************************
                    elseif(($cell == 4 || $cell == 3) && $row == 6) {
                        echo 10;
                    }
//**********************************
                    elseif(($cell == 3 || $cell == 5) && $row == 7) {
                        echo 15;
                    }
//**********************************
                    elseif(($cell == 4) && $row == 7) {
                        echo 20;
                    }
//**********************************
                    elseif(($cell == 3 || $cell == 6) && $row == 8) {
                        echo 21;
                    }
//**********************************
                    elseif(($cell == 4 || $cell == 5) && $row == 8) {
                        echo 35;
                    }
//**********************************
                    elseif(($cell == 3 || $cell == 7) && $row == 9) {
                        echo 28;
                    }
//**********************************
                    elseif(($cell == 4 || $cell == 6) && $row == 9) {
                        echo 56;
                    }
//**********************************
                    elseif(($cell == 5) && $row == 9) {
                        echo 70;
                    }
//**********************************
                    elseif(($cell == 3 || $cell == 8) && $row == 10) {
                        echo 36;
                    }
//**********************************
                    elseif(($cell == 4 || $cell == 7) && $row == 10) {
                        echo 84;
                    }

                    else {
                        echo 126;
                    }
                    ?> </td>
            <?php endfor; ?>
        </tr>
    <?php endfor; ?>
</table>

















